ErikCode/fan/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.2                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
   version         2.0;
   format          ascii;

   root            "";
   case            "";
   instance        "";
   local           "";

   class           dictionary;
   object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

x0 0.0;
x1 5.0;
//x2 4.0;
x3 10.0;

y0 0.0;
y1 1.0;

z0 0.0;
z1 1.0;

vertices
(
    ( $x0 $y0 $z0 )
    ( $x1 $y0 $z0 )
    ( $x1 $y1 $z0 )
    ( $x0 $y1 $z0 )
    ( $x0 $y0 $z1 )
    ( $x1 $y0 $z1 )
    ( $x1 $y1 $z1 )
    ( $x0 $y1 $z1 )
    ( $x3 $y0 $z0 )
    ( $x3 $y1 $z0 )
    ( $x3 $y0 $z1 )
    ( $x3 $y1 $z1 )    
);

blocks
(
    hex (  0  1  2  3  4  5  6  7 ) upstream ( 160 40 40 ) simpleGrading ( 1 1 1 )
    hex (  1  8  9  2  5  10 11 6 ) upstream ( 160 40 40 ) simpleGrading ( 1 1 1 )
);

patches
(
    patch inlet
    (
        ( 0 4 7 3 )
    )
    patch outlet
    (
        ( 9 11 10 8 )
    )
    wall walls 
    (
        ( 0 1 2 3 )
        ( 1 8 9 2 )
        ( 0 1 5 4 )
        ( 1 8 10 5 )
        ( 4 5 6 7 )
        ( 5 10 11 6 )
        ( 3 7 6 2 )
        ( 2 6 11 9 )
    )
);

mergePatchPairs
(
);


