ErikCode/fan/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            totalPressure;
        p0              uniform 0;
        phi             phi;
        U               U;
        rho             none;
        psi             none;
        gamma           1;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    walls
    {
        type            zeroGradient;
    }
/*    fan_half0
    {
        type            fan;
        patchType       cyclic;
        f               List<scalar> 2(10 -1);
    }
    fan_half1
    {
        type            fan;
        patchType       cyclic;
        f               List<scalar> 2(10 -1);
    }*/
}


// ************************************************************************* //
