ErikCode/fan/0/VolumeForce
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v3.0+                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     3.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      VolumeForce;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 1 -2 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inlet           
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }

    outlet          
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }

    walls       
    {
        type            fixedValue;
        value           uniform (0.0 0.0 0.0);
    }
/*    fan_half0
    {
        type            cyclic;
    }
    fan_half1
    {
        type            cyclic;
    }*/
}


// ************************************************************************* //
